<a href="https://colab.research.google.com/github/amaziarczyk/Projects/blob/master/sql_file.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
import sqlite3

In [ ]:
tab = sqlite3.connect("SQLite.db")
kursor= tab.cursor()

In [ ]:
# tworzenie tabeli
kursor.execute("Create table imiona (id integer, imie text, cena integer)")

In [ ]:
kursor.execute("INSERT INTO imiona VALUES (100, 'Ola', 20),(200,'Kasia',30)")

In [ ]:
tab.commit()

In [ ]:
print(tab)

<sqlite3.Connection object at 0x7f70582f9e30>

In [ ]:
tab.close()

In [ ]:
# wczytanie tabeli
bd = sqlite3.connect("SQLite.db")
kursor = bd.cursor()
kursor.execute("SELECT * FROM imiona")

In [ ]:
print(kursor.fetchone())

(100, 'Ola', 20)

In [ ]:
#dodawanie danych do tabeli
a = [
    (15, 'Ola', 25),
    (12, 'Ala', 30),
    (14, 'Magda', 24)
]
a

[(15, 'Ola', 25), (12, 'Ala', 30), (14, 'Magda', 24)]

In [ ]:
kursor.executemany("INSERT INTO imiona VALUES(?,?,?)", a)
bd.commit()

In [ ]:
kursor.execute("SELECT * FROM imiona").fetchall()

[(100, 'Ola', 20),
 (100, 'Ola', 20),
 (200, 'Kasia', 30),
 (15, 'Ola', 25),
 (12, 'Ala', 30),
 (14, 'Magda', 24),
 (15, 'Ola', 25),
 (12, 'Ala', 30),
 (14, 'Magda', 24)]

In [ ]:
for i in kursor.execute("SELECT * FROM imiona"):
  print(i)

(100, 'Ola', 20)
(100, 'Ola', 20)
(200, 'Kasia', 30)
(15, 'Ola', 25)
(12, 'Ala', 30)
(14, 'Magda', 24)
(15, 'Ola', 25)
(12, 'Ala', 30)
(14, 'Magda', 24)

In [ ]:
bd.close()

In [ ]:
poloczenie = sqlite3.connect("SQLite.db")
df = pd.read_sql("SELECT * FROM imiona;", poloczenie)

In [ ]:
df

    id   imie  cena
0  100    Ola    20
1  100    Ola    20
2  200  Kasia    30
3   15    Ola    25
4   12    Ala    30
5   14  Magda    24
6   15    Ola    25
7   12    Ala    30
8   14  Magda    24

In [ ]:
df

In [ ]:
pd.read_sql("SELECT imie, cena FROM imiona;", poloczenie)

    imie  cena
0    Ola    20
1    Ola    20
2  Kasia    30
3    Ola    25
4    Ala    30
5  Magda    24
6    Ola    25
7    Ala    30
8  Magda    24

In [ ]:
pd.read_sql("SELECT * FROM imiona ORDER BY imie;", poloczenie)

    id   imie  cena
0   12    Ala    30
1   12    Ala    30
2  200  Kasia    30
3   14  Magda    24
4   14  Magda    24
5  100    Ola    20
6  100    Ola    20
7   15    Ola    25
8   15    Ola    25

In [ ]:
pd.read_sql("SELECT * FROM imiona ORDER BY imie DESC;", poloczenie)

    id   imie  cena
0  100    Ola    20
1  100    Ola    20
2   15    Ola    25
3   15    Ola    25
4   14  Magda    24
5   14  Magda    24
6  200  Kasia    30
7   12    Ala    30
8   12    Ala    30

In [ ]:
pd.read_sql("SELECT * FROM imiona GROUP BY imie;", poloczenie)

    id   imie  cena
0   12    Ala    30
1  200  Kasia    30
2   14  Magda    24
3   15    Ola    25

In [ ]:
pd.read_sql("SELECT * FROM imiona WHERE cena BETWEEN 20 and 100;", poloczenie)

    id   imie  cena
0  100    Ola    20
1  100    Ola    20
2  200  Kasia    30
3   15    Ola    25
4   12    Ala    30
5   14  Magda    24
6   15    Ola    25
7   12    Ala    30
8   14  Magda    24

In [ ]:
a= sqlite3.connect("table2.db")

In [ ]:
kursor2=a.cursor()

In [ ]:
kursor2.execute("CREATE TABLE tabela2 (imie text, numer number,zwierze text)")

In [ ]:
b= [
    ("Ola", 15202, 'kot'),
    ("Ala", 25145, 'pies'),
    ("Sandra", 65625,"krowa")
]

In [ ]:
kursor2.executemany("Insert into tabela2 values(?,?,?)", b)
a.commit()

In [ ]:
kursor2.execute("Select * from tabela2").fetchone()

('Ola', 15202, 'kot')